aboutHBase/aboutRowkey.org
#+TITLE: 关于Rowkey的设计
* 防止数据倾斜
rowkey时按照二进制顺序排列的，为防止数据倾斜，需要采用散列的方式将数据相对均匀的分布在各个RegionServer上。

库表定义如下：
#+BEGIN_SRC
create 'tbl_radius_login',{NAME => 'login',VERSIONS => 1, TTL =>
 60*60*24*3},{SPLITS => [
 '01','02','03','04','05','06','07','08','09','10',
 '11','12','13','14','15','16','17','18','19','20',
 '21','22','23','24','25','26','27','28','29','30',
 '31','32','33','34','35','36','37','38','39','40',
 '41','42','43','44','45','46','47','48','49','50',
 '51','52','53','54','55','56','57','58','59','60',
 '61','62','63','64','65','66','67','68','69','70',
 '71','72','73','74','75','76','77','78','79','80',
 '81','82','83','84','85','86','87','88','89','90',
 '91','92', '93','94 ','95','96','97','98','99'
 ]}
#+END_SRC

数据入库前，手工在rowkey前拼一个通过散列函数计算出来的数字。

其中分成多少份和RegionServer、datanode的个数关系还不是很清楚。
