aboutHBase/aboutRowkey.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>关于Rowkey的设计</title>
<!-- 2016-03-27 Sun 23:00 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="赵光建" />
</head>
<body>
<div id="content">
<h1 class="title">关于Rowkey的设计</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 防止数据倾斜</a></li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 防止数据倾斜</h2>
<div class="outline-text-2" id="text-1">
<p>
rowkey时按照二进制顺序排列的，为防止数据倾斜，需要采用散列的方式将数据相对均匀的分布在各个RegionServer上。
</p>

<p>
库表定义如下：
</p>
<pre class="example">
create 'tbl_radius_login',{NAME =&gt; 'login',VERSIONS =&gt; 1, TTL =&gt;
 60*60*24*3},{SPLITS =&gt; [
 '01','02','03','04','05','06','07','08','09','10',
 '11','12','13','14','15','16','17','18','19','20',
 '21','22','23','24','25','26','27','28','29','30',
 '31','32','33','34','35','36','37','38','39','40',
 '41','42','43','44','45','46','47','48','49','50',
 '51','52','53','54','55','56','57','58','59','60',
 '61','62','63','64','65','66','67','68','69','70',
 '71','72','73','74','75','76','77','78','79','80',
 '81','82','83','84','85','86','87','88','89','90',
 '91','92', '93','94 ','95','96','97','98','99'
 ]}
</pre>

<p>
数据入库前，手工在rowkey前拼一个通过散列函数计算出来的数字。
</p>

<p>
其中分成多少份和RegionServer、datanode的个数关系还不是很清楚。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: 赵光建</p>
<p class="date">Created: 2016-03-27 Sun 23:00</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
